namespace AnimalShelter.Web.Infrastructure.Enums
{
    using System.ComponentModel.DataAnnotations;

    public enum SearchCity
    {
        Всички = 1,
        [Display(Name = "София-град")] СофияГрад = 2,
        Бургас = 3,
        Варна = 4,
        [Display(Name = "Велико Търново")] ВеликоТърново = 5,
        Видин = 6,
        Враца = 7,
        Добрич = 8,
        Кърджали = 9,
        Кюстендил = 10,
        Ловеч = 11,
        Монтана = 12,
        Пазарджик = 13,
        Перник = 14,
        Плевен = 15,
        Пловдив = 16,
        Разград = 17,
        Русе = 18,
        Силистра = 19,
        Сливен = 20,
        Смолян = 21,
        Благоевград = 22,
        [Display(Name = "София-Област")] СофияОбласт = 23,
        [Display(Name = "Стара Загора")] СтараЗагора = 24,
        Търговище = 25,
        Хасково = 26,
        Шумен = 27,
        Ямбол = 28,
        Габрово = 29,
    }
}
